[
  {
    "url": "https://oursggrants.gov.sg/grants/ssgacg/instruction",
    "rawText": "A Singapore Government Agency Website\nExplore Grants\nAbout Us\nHelp\nContact\nLog in\nSPORT SINGAPORE\nACTIVE CITIZEN GRANT\nINSTRUCTIONS\nAbout this grant\nWe support community sporting events/projects that fulfil any of the following objectives:\nEngage the community with meaningful and impactful volunteering opportunities.\nDemonstrate innovative ways of engaging and inspiring the community through sport, physical activity or health & wellness initiatives.\nIncorporate elements of “Care” that contribute towards building a caring society e.g. by providing opportunities for social mixing among different groups, offering volunteering platforms for the community to give back to society, rallying participation and contribution behind a good cause.\n\nWho can apply?\n\nAnyone can apply, but Team Nila projects should promote/involve sport volunteerism, while YouthCreates projects should support youth-led sporting initiatives and Team Singapore projects should strengthen affinity for Team Singapore athletes.\n\nMore details on eligibility are available in the grant guidelines.\n\nWhen can I apply?\n\nAll year round for Team Nila, Team Singapore & YouthCreates.\n\nHow much funding can you receive?\n\nYouthCreates, Team Nila & Team Singapore are capped at $20,000.\n\nHow to apply?\nCompleting the grant application should take about 30 mins with all the information on hand. All fields are mandatory unless otherwise stated.\nDOCUMENTS REQUIRED FOR APPLICATION\nComplete the following documents and upload them to the relevant sections of the form before you submit your application:\nActive Citizen_Project_Proposal_V1 (DOCX 62.9 KB)\nActive Citizen Budget Form (XLSX 19.9 KB)\nActive Citizen_Consent Form (DOCX 23.3 KB) (if below 18 years old)\nTotal upload size per submission must not exceed 50MB.\nAPPLY AS AN INDIVIDUAL\nAPPLY AS AN ORGANISATION\nYou will be directed to login via Singpass. Upon successful login, select the relevant UEN ID.\nCan’t find what you are looking for?\nTo find more information about our grants, visit our help center.\nTo explore more community grants in Singapore, visit the community grants register\nIf you have questions or suggestions about our portal, we'd love to hear from you.\nOurSG Grants\nOurSG Grants portal brings government grants for the arts, community, heritage, social good, sports and youth into one place.\nReport Vulnerability\nPrivacy\nTerms of Use\nDeveloped by Government Digital Products\nA Division of Government Technology Agency Singapore\n© 2026 Government of Singapore. Last Updated 19 Jan 2026 v2.59.2\nThis site is best viewed using the latest two versions of Chrome, Safari, Microsoft Edge and Firefox.",
    "scrapedAt": "2026-01-19T06:21:50.203Z"
  },
  {
    "url": "https://oursggrants.gov.sg/grants/nycaep/instruction",
    "rawText": "A Singapore Government Agency Website\nExplore Grants\nAbout Us\nHelp\nContact\nLog in\nNATIONAL YOUTH COUNCIL\nASIA-READY EXPOSURE PROGRAMME\n\n(AEP)\nINSTRUCTIONS\nAbout this grant\n\nThe Asia-Ready Exposure Programme (AEP) supports educational institutions based and registered in Singapore to provide youths with opportunities to gain industry and cultural exposure to ASEAN member states, China and/or India (ACI).\n\nThe AEP aims to:\n\nIncrease youth awareness and understanding of the social, cultural and political dimensions of the ACI cities;\nIncrease awareness of the economic growth trajectories and opportunities in the ACI markets; and\nBroaden personal growth opportunities and youth ACI networks.\nInterested applicants are to read the AEP Factsheet and FAQ, complete the online application and submit the required documents to NYC at least 3 months before the proposed AEP Project Start Date.\n\nWho Can Apply?\n\nInstitutes of Higher Learning (IHLs, e.g. Institute of Technical Education, Polytechnic, University, Private Education Institution, Madrasah) based and registered in Singapore\n\nWhen to Apply?\n\nApplication is open throughout the year.\n\nApplication should be submitted at least 3 months before the proposed AEP Project Start Date.\n\nApplicants who require assistance to fine-tune their proposals are encouraged to send the AEP proposal to AEP_enquiries@nyc.gov.sg before the 3 months submission timeline and factor in adequate time to amend the proposal.\n\nHow much funding can you receive?\n\nUp to S$1,000 per eligible youth, subject to a grant cap* per institution per financial year\n\n*confirmed annually on a case-by-case basis\n\nEligible youths refer to youths who meet all 4 criteria below:\n\n15 to 35 years old;\nSingapore Citizens or Singapore Permanent Residents (PR);\nCurrently studying in Institutes of Higher Learning (e.g. ITE Colleges, Polytechnics, Universities, Private Education Institutions, Madrasah etc.); and\nHave not been funded under the same life stage (i.e. education level) before.\n\nThe grant will generally be disbursed in two tranches, depending on the duration of the project and other consideration factors. The remaining grant will be disbursed upon fulfilment of the deliverables and receipt of satisfactory report(s) of the project.\n\nHow to apply?\nCompleting the grant application should take about 30 mins with all the information on hand. All fields are mandatory unless otherwise stated.\nDOCUMENTS REQUIRED FOR APPLICATION\nComplete the following documents and upload them to the relevant sections of the form before you submit your application.\n\nFor Adhoc Application:\nAEP Proposal and Endorsement Letter\nAEP Budget\nOSG AEP Name List (if ready)\nAny other supporting information (e.g. powerpoint presentation, detailed programme itinerary, corporate deck etc.)\n\nFor Programme Funding Partners:\nUpdated AEP PF Dashboard at least 1 to 2 months prior to the start date of the trip(s)\nOSG AEP Name List (if ready)\nDetailed Day-to-Day Itinerary (if available)\nSigned Partnership Agreement and Partner’s Proposal as indicated in the Partnership Agreement (if available)\n\n[For Adhoc Application / Programme Funding Partners] Additional documents you may need to submit:\nCopies of relevant permits and licenses (if any)\nDeclaration of all potential sponsorships and partnership (if any)\nTotal upload size per submission must not exceed 50MB.\nAPPLY AS AN ORGANISATION\nYou will be directed to login via Singpass. Upon successful login, select the relevant UEN ID.\nCan’t find what you are looking for?\nTo find more information about our grants, visit our help center.\nTo explore more community grants in Singapore, visit the community grants register\nIf you have questions or suggestions about our portal, we'd love to hear from you.\nOurSG Grants\nOurSG Grants portal brings government grants for the arts, community, heritage, social good, sports and youth into one place.\nReport Vulnerability\nPrivacy\nTerms of Use\nDeveloped by Government Digital Products\nA Division of Government Technology Agency Singapore\n© 2026 Government of Singapore. Last Updated 19 Jan 2026 v2.59.2\nThis site is best viewed using the latest two versions of Chrome, Safari, Microsoft Edge and Firefox.",
    "scrapedAt": "2026-01-19T06:21:56.111Z"
  },
  {
    "url": "https://oursggrants.gov.sg/grants/neacif/instruction",
    "rawText": "",
    "scrapedAt": "2026-01-19T06:22:01.483Z"
  }
]